Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བའི་སྲོག་སྩལ་དུ་གསོལ་ཞེས་ནས།
en: Spare the life of Prince Vijitāvin!’

source: དེ་ནས་རྒྱལ་པོས་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་མདུན་དུ་བཞག་སྟེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་གཡོན་དང་ལྡན་པའི་མྱི་འདི་རྣམས་ཐོང་།
en: “Then the king had Prince Vijitāvin brought before him and said to him, ‘Prince, abandon those people who are criminals!

source: དེ་སྟེ་མྱི་གཏོང་ཞིང་དེ་རྣམས་ཀྱི་ལེ་ལན་དུ་ཤི་བར་གྱུར་ཏ་རེ་ཞེས་པ་དང་།
en: If you do not abandon them, you will be executed in their stead!’

source: དེས་ཞུམ་པ་མྱེད་པའི་སེམས་མ་འཁུམས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམྱིགས་པར་བརྩོན་པ། གཞན་ལ་ཕན་པར་གཞོལ་བ། སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བས་འཆི་བར་ཁས་བླངས་པ་དང་།
en: “The prince was not disheartened or discouraged but was engaged in attaining the goal of omniscience, was dedicated to benefiting others, was led in all his actions by compassion, and accepted his death.

source: དེའི་མས་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ལ་ཟླ་བ་ཕྱེད་ཅིག་ཏུ་ཕྲད་པར་གསོལ་བ་བཏབ་པ། དགུང་ཟླ་ཕྱེད་གཅིག་ཏུ་གཞོན་ནུ་འདི་སྦྱིན་པ་སྩོལ་དུ་ཅི་གནང་། དེ་སླན་ཅད་ནི་སུ་ཅི་དགྱེས་པ་དེའང་མཛད་པར་གསོལ་ཞེས་པ་དང་།
en: “His mother requested King Jayaprabha to give him half a month, saying, ‘I request that this prince be allowed to perform acts of charity for half a month, and after that you may do as you wish.’

source: དེ་དེ་ལྟར་གྱིས་ཤིག་ཅེས་རྒྱལ་པོས་གནང་ངོ་། །
en: “The king gave his permission, saying, ‘Let it be so!’

source: དེ་ནས་རྒྱལ་པོའི་གནས་དགའ་བས་བརྒྱན་པ་དེའི་བྱང་ཕྱོགས་ལོགས་ཤིག་ན། སྔོན་མཆོད་སྦྱིན་གྱི་གནས་སུ་བྱ་བའི་བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་ཉི་མའི་འོད་ཅེས་བྱ་བ་དེར་གཞོན་ནུ་དེ་སོང་ནས།
en: “The prince went to the great park called Sūrya­prabha, which was to the north of Rativyūhā, the royal capital, and was the traditional location for offerings and acts of charity.

source: སུ་ཅི་འདོད་པ་དེ་ལ་དེ་བྱིན་ཏེ། དེས་གཏན་པ་མྱེད་པའི་མཆོད་སྦྱིན་བྱས་ནས་ཟླ་བ་ཕྱེད་དུ་སྦྱིན་པ་རྣམ་པ་སྣ་ཚོགས་བྱིན་ཏེ། ཟས་འདོད་པ་ལ་ཟས་བྱིན། སྐོམ་འདོད་པ་ལ་སྐོམ་བྱིན། བཞོན་པ་དང་།
en: There the prince gave anyone whatever they wanted, making unconditional offerings and gifts of every kind for half a month.

source: གོས་དང་། མེ་ཏོག་དང་། ཕྱེ་མ་དང་། བྱུག་པ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་རིན་པོ་ཆེའི་རྒྱན་དང་། ཡོ་བྱད་ཐམས་ཅད་དང་། ལྷབ་ལྷུབ་ཐམས་ཅད་དང་། ཡོ་བྱད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱང་དེ་དག་འདོད་པ་ལ་ཡོངས་སུ་བཏང་སྟེ།
en: He gave food to those who wanted food, gave drink to those who wanted drink, and likewise gave steeds, clothes, flowers, powders, ointments, Dharma robes, parasols, banners, flags, precious jewelry, all ornaments, and every kind of necessity that was wished for.

source: དེ་ནས་ཉི་མ་ཐ་མ་ལ་བབ་པར་གྱུར་བ་དང་། འགྲོ་བ་མང་པོའི་ཚོགས་ཀུན་ནས་འདུས་ཏེ།
en: “When the last day arrived, an assembly of many beings gathered.

source: རྒྱལ་པོའི་བློན་པོ་དང་། བུད་མྱེད་ཀྱི་ཚོགས་དང་། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། ལྗོངས་དང་། ཡུལ་གྱི་མྱི་དང་། ཞགས་པ་འཐུབ་པ་ཐམས་ཅད་ཀྱང་ཀུན་ནས་འདུས།
en: The king’s ministers, the group of queens, the head merchants, the householders, the people of the land, and the Jains assembled.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མ་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེ་ཡང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དུས་ཐུགས་སུ་ཆུད་ནས། མཆོད་སྦྱིན་གྱི་གནས་དེར་གཤེགས་ཏེ། ལྷའི་དབང་པོའི་ཚོགས་ཀྱིས་ནི་ཡོངས་སུ་བསྐོར། ཀླུའི་དབང་པོས་ནི་ཡང་དག་པར་མཆོད། གནོད་སྦྱིན་གྱི་དབང་པོས་ནི་ལུས་མངོན་པར་བཏུད།
en: “The Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, knowing it was the time to guide and ripen beings, also went to the site of the distribution of gifts.

source: དྲི་ཟའི་དབང་པོས་ནི་མངོན་པར་བསྟོད། ལྷ་མ་ཡིན་གྱི་དབང་པོས་ནི་ལུས་ཤིན་ཏུ་བཏུད་ནམ་མཁའ་ལྡིང་གི་དབང་པོ་གཙུག་གི་རིན་པོ་ཆེས་རྣམ་པར་བརྒྱན་པས་ནི་སེམས་དང་བའི་མཆོད་པའི་རྣམ་པས་རབ་ཏུ་བཀང་། མྱིའམ་ཅིའི་དབང་པོ་རྣམས་ཀྱིས་ནི་དགའ་བའི་ཡིད་ཀྱིས་ཡོངས་སུ་མཆོད་དེ། བསྟོད་པའི་གླུའི་དབྱངས་ཀྱིས་ཡོངས་སུ་བསྐུལ། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་རྣམས་ཀྱིས་ནི་ཀུན་ནས་བསྐོར་ཅིང་ཞལ་དུ་བལྟ་བ་དེ། འགྲོ་བའི་ཚོགས་ཆེན་པོ་དེ་དང་།
en: A gathering of lords of the devas was his entourage; lords of the nāgas made offerings to him; lords of the yakṣas were bowing to him; lords of the gandharvas were praising him; lords of the asuras were bowing down to him; lords of the garuḍas, who were adorned by crest jewels, were with delight strewing offerings; lords of the kinnaras made offerings with joy and sang inspirational songs of praise; and lords of the mahoragas encircled him, gazing at his face.

source: རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མ་རྒྱལ་པོ་ཤིན་ཏུ་མཛེས་པ་བལྟ་ན་སྡུག་པ། དབང་པོ་ཞི་བ་ཐུགས་ཞི་བ། ཤིན་ཏུ་དབེན་པར་དབང་པོ་ལས་རྒྱལ་བ། གླང་པོ་ལྟར་ཤིན་ཏུ་དུལ་བ། མཚོ་ལྟར་རབ་ཏུ་དང་ཞིང་གསལ་ལ་རྙོག་པ་མྱེད་པ། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་དང་། ཆོ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ཆེན་པོས་ནི་རྣམ་པར་མཛེས། སངས་རྒྱས་ཀྱི་བདག་ཉིད་ཆེ་བས་ནི་རབ་ཏུ་འབར།
en: “That great gathering of beings and Prince Vijitāvin saw, approaching from afar, the Bhagavat, the Tathāgata Arhat Samyak­saṃbuddha Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, who was handsome and delightful to look at, with pacified senses and a pacified mind, withdrawn, victorious over the senses, as tame as an elephant, as pure, clear, and unpolluted as a lake, beautified by buddhahood’s emanations and great miraculous manifestations and by the powerful supremacy of buddhahood, and shining with the greatness of buddhahood.

source: སངས་རྒྱས་ཀྱི་མཚན་དང་དཔེ་བྱད་བཟང་པོའི་རྒྱན་གྱིས་ནི་སྐུ་མཛེས་པར་བརྒྱན། འཇིག་རྟེན་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་སྣང་བས་རྒྱས་པར་འགེངས་ཤིང་། སངས་རྒྱས་ཀྱི་འོད་ཟེར་གྱིས་རབ་ཏུ་སྣང་བ་མཛད། སྐུའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ནི། སྤོས་རིན་པོ་ཆེའི་ངད་འཕྲོ་བའི་འཁོར་ལོ་རབ་ཏུ་འགྱེད། སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་བསྐྱོད་པའི་ཚུལ་དུ་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱོད་པ་མཛད་ཅིང་།
en: His body was beautifully adorned by the adornments of the physical signs and features of a buddha, and he was filling all worlds with the illumination of a buddha’s halo of light, illuminating with a buddha’s light rays, emanating a field of the spreading aroma of precious perfumes from all his body’s pores, and shaking all world realms in the manner of shaking buddha realms.

source: རྒྱན་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པའི་སངས་རྒྱས་ཀྱི་རྣམ་པར་གནོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤོང་བའི་སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་མཛད་པའི་སངས་རྒྱས་ཀྱི་ཞལ་བལྟ་བའི་བྱིན་གྱིས། ཕ་ཟད་ཅིག་ནས་ཚུར་གཤེགས་པ་མཐོང་ནས། དེ་བཞིན་གཤེགས་པ་ལ་སེམས་མངོན་པར་མོས་པར་གྱུར་ཏོ། །
en: He was approaching while sending down a rain from a cloud of all adornments, with the prowess of buddhahood, with the conduct of buddhahood that eliminates kleśas within all beings, and through the sight of the buddha’s face increasing the power of joy in all beings, who on seeing the tathāgata gained faith in their minds in the tathāgata.

source: དེ་ནས་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་དང་། འགྲོ་བའི་ཚོགས་ཆེན་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོ་དེ། ཕ་ཟད་དུ་བསུ་ནས་མོས་པའི་སེམས་ཀྱིས་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ་ཕྱག་འཚལ་ནས། ཞབས་གཉིས་ལ་སྤྱི་བོས་གཏུགས་ཏེ།
en: “Then Prince Vijitāvin and the great gathering of beings went to greet in the distance the Bhagavat Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, and with faith in him they prostrated with their whole bodies, touching the tops of their heads to his feet.

source: མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡང་དག་པར་མཆོད་ནས་ཚིག་འདི་སྐད་དུ་བརྗོད་དོ། །བཅོམ་ལྡན་འདས་ཚུར་གཤེགས་སུ་གསོལ།
en: They offered various kinds of offerings to him and said, ‘Come, Bhagavat!

source: བདེ་བར་གཤེགས་པ་ཚུར་གཤེགས་སུ་གསོལ།
en: Come, Sugata!

source: དེ་བཞིན་གཤེགས་པས་བདག་ཅག་དགོངས་སོ། །
en: Tathāgata, pay heed to us!

source: བདེ་བར་གཤེགས་པས་བདག་ཅག་ཡོངས་སུ་བཟུང་ངོ་། །
en: Tathāgata, take us into your care!’

source: དེ་ནས་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་བཅོམ་ལྡན་འདས་ལ་གདན་དམ་པས་བསྟབས་ཏེ།
en: “Then Prince Vijitāvin prepared an excellent seat for the Bhagavat and said to him, ‘Bhagavat, I request that you be seated upon this seat that has been arranged for you.’

source: འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གདན་བཏིང་བ་འདིར་བཞུགས་སུ་གསོལ་ཞེས་ནས་བཅོམ་ལྡན་འདས་དེར་གཤེགས་པ་དང་གདན་དེ་ཡང་གཙང་སྦྲ་ལྷུར་ལེན་པའི་ལུས་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་རིན་པོ་ཆེ་སྤོས་ཀྱི་རྒྱལ་པོའི་པདྨོའི་སྙིང་པོ་ཅན་དུ་བྱིན་གྱིས་བརླབས་ནས།
en: “The Bhagavat approached it, and, through the blessing of the buddha, the types of devas who were devoted to cleanliness of the body transformed the seat so that it had in its center a lotus of the king of precious perfumes.

source: གདན་དེ་ལ་བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་བཞུགས་སོ། །འཁོར་གྱི་སྟན་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཁོད་དེ།
en: “The Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, sat upon that seat, and bodhisattvas sat upon the surrounding seats.

source: དེའི་ཞལ་མཐོང་མ་ཐག་ཏུ་འཁོར་དེའི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་། སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་ཏེ། ནད་ཐམས་ཅད་ཀྱང་ཞི་བར་གྱུར་ནས། འཕགས་པའི་ཆོས་ཀྱི་སྣོད་དུ་གྱུར་ཏོ། །
en: The beings of that assembly, as soon as they saw his face, became freed from all obscurations; all their illnesses ceased, and they became vessels for the Dharma of the āryas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་བོས་སེམས་ཅན་དེ་དག་སྣོད་དུ་གྱུར་པར་ཐུགས་སུ་ཆུད་ནས། བསྟན་པ་རིམ་པས་བཀའ་སྩལ་ཏེ།
en: “Then the Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, knowing that those beings had become ready vessels, gave the teachings in stages.

source: འདི་ལྟར་རྒྱུའི་དཀྱིལ་འཁོར་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་མདོ་སྡེ་ཡང་དག་པར་བསྟན་ནས་ཞལ་གྱི་སྒོ་ནས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐད་རྒྱ་མཚོ་དང་།
en: He taught the sūtra called The Illumination of the Field of Causes.

source: ངེས་པའི་ཚིག་དང་། ངག་གིས་དབྱངས་སུ་བརྗོད་པའི་གསུང་དབྱངས་ཀྱི་ཡན་ལག་སྟོང་དང་ལྡན་པ། ཆོས་ཀྱི་ཡན་ལག་ཐམས་ཅད་དང་ལྡན་པ་རབ་ཏུ་བསྒྲགས་པ་དང་།
en: He spoke through the entire ocean of the languages of beings, definitions, and sounds of the voice, speaking with the thousands of aspects of speech and possessing the thousands of aspects of the Dharma.

source: དེའི་མོད་ལ་འཁོར་དེ་ནས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་ནི་རྡུལ་དང་བྲལ་ཏེ། དྲི་མ་མྱེད་པར་གྱུར་ནས། ཆོས་ལ་ཆོས་ཀྱི་མྱིག་སྐྱེས་པར་གྱུར་ཏོ། །སྲོག་ཆགས་བྱེ་བ་མང་ཞིག་གིས་ནི། མྱི་སློབ་པའི་ས་ཐོབ་པར་གྱུར་ཏོ། །སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་ནི་ཐེག་པ་ཆེན་པོ་ལ་རྣམ་པར་དུལ་བར་གྱུར་ཏོ། །
en: “At that moment, eight hundred million beings within that assembly became free of impurities, became stainless, and developed the Dharma vision of the Dharma; many millions of beings attained the state beyond training; and ten thousand beings were guided into the Mahāyāna.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན་ཏུ་བཟང་པོ་དང་། སྨོན་ལམ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པའི་ཚུལ་ལ་ཞུགས་པར་གྱུར་ཏོ། །
en: Thus they entered into the way of completely good bodhisattva conduct and accomplished great prayers.

source: དེ་ལྟར་བཅོམ་ལྡན་འདས་དེས་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་ཚེ། ཕྱོགས་བཅུའི་སེམས་ཅན་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཐེག་པ་ཆེན་པོ་ལ་རྣམ་པར་དུལ་བར་གྱུར་ཏོ། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་སངས་རྒྱས་ཀྱི་ཞིང་འབྱམ་ཀླས་པ་སྣ་ཚོགས་སུ་གཏོགས་པའི་སེམས་ཅན་མཐའ་དང་དབུས་མྱེད་པ་དག་གི་ཡང་ངན་སོང་གི་ས་རྣམ་པར་བཟློག་པར་གྱུར་ཏོ། །
en: “When the Bhagavat this time turned the wheel of the Dharma through the great miraculous powers of buddhahood, beings in the ten directions, as numerous as the atoms in a hundred thousand buddha realms, were guided into the Mahāyāna; beings without end or middle throughout the extent of the various worlds and buddha realms were turned away from the lower existences, and beings beyond number were brought onto the path to rebirth in the higher existences.

source: སེམས་ཅན་གྲངས་ལས་འདས་པ་ཞིག་ནི་མཐོ་རིས་སུ་སྐྱེ་བའི་ལམ་ལ་རབ་ཏུ་བཀོད་པར་གྱུར་ཏོ། །རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཐོབ་པར་གྱུར་ཏོ། །རིགས་ཀྱི་བུ་དེ་ལ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་བྱུང་སྟེ། རང་གི་ལུས་དང་སྲོག་ཡོངས་སུ་བཏང་ནས།
en: “Prince Vijitāvin also attained this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings.

source: ནོར་གྱི་ཚོགས་དང་། འཁོར་ཐམས་ཅད་དང་། མྱིའི་འཇིག་རྟེན་ན་འཚོ་བའི་བདེ་བ་ཡོངས་སུ་སྤངས་ནས་བཙོན་ར་ན་འཁོང་པའི་སེམས་ཅན་དེ་དག་ཐར་བར་བྱས་པ། མཆོད་སྦྱིན་ཆེན་པོ་གཏན་པ་མྱེད་པའི་མཆོད་སྦྱིན་བྱེད་བྱེད་པ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོ་དེ་ལ་བསྙེན་བཀུར་བྱེད་བྱེད་པ་དེ་བཞིན་གཤེགས་པ་དེའི་ཞལ་མཐོང་བའི་མོད་ལ་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: “Noble one, at that time, in that time, there was the prince named Vijitāvin who gave up his own body and life, his accumulation of wealth, his entire entourage, and the happiness of living in the human world and freed those beings who were in prison, made an unrestricted great distribution of gifts and offerings, honored the Bhagavat, the Tathāgata Arhat Samyak­saṃbuddha Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, and, when he saw the face of that tathāgata, developed the aspiration for the highest complete enlightenment and attained this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡང་ཐོབ་པར་གྱུར་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི།
en: If you think he was anyone else, noble one, do not see him in that way.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མྱི་བལྟ་སྟེ། ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །དེ་ལྟར་ཁོ་མོ་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: At that time, in that time, I was the prince named Vijitāvin.

source: སྙིང་རྗེ་ཆེན་པོས་རབ་ཏུ་མྱི་དགའ་ཞིང་འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པར་ཞུགས་ཏེ། ཁམས་གསུམ་ལ་མྱི་གནས་པ་དང་། རྣམ་པར་སྨྱིན་པའི་ལན་ལ་རེ་བ་མྱེད་པ་དང་། གྲགས་པ་དང་སྙན་པ་དང་། མྱིང་སྨོས་པ་ལ་མངོན་པར་དགའ་བ་མྱེད་པ་དང་། བདག་ལ་བསྟོད་པ་མྱེད་པ་དང་། གཞན་ལ་སྨོད་པ་མྱེད་པ་དང་། དངོས་པོ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མྱེད་པ་དང་། སྲིད་པའི་འདུ་ཤེས་ལས་གྱེན་དུ་འཕགས་པ་དང་། ཁམས་གསུམ་པ་ལ་མངོན་པར་དགའ་བ་མྱེད་པ་དང་། འཇིག་རྟེན་གྱི་ཡུལ་གྱི་བདེ་བ་ལས་ཕྱིར་ཕྱོགས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་མངོན་ཏུ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་རྣམ་པར་དག་པ་དང་། ལྷག་པའི་བསམ་པ་རྡོ་རྗེ་ཡོངས་སུ་གྲུབ་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་བྱམས་པ་ཆེན་པོས་ནན་ཏན་དུ་བྱེད་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བས་སྡུག་བསྔལ་རྣམ་པར་ཞི་བར་བྱ་བ་ལ་བརྩོན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་ལ་བསམ་པ་ཐག་པ་ནས་ལྷག་པར་དམྱིགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་སྦྱང་བ་དང་། ཐེག་པ་ཆེན་པོའི་རྒྱན་གྱིས་འབྱུང་བའི་ལམ་རབ་ཏུ་བརྒྱན་པར་བྱ་བ་དང་།
en: In that way, I was the prince named Vijitāvin, who became saddened because of great compassion and who engaged in benefiting all beings without any hope of not remaining in the three realms or of having a karmic result in return; without any delight in fame, renown, or a great name; without praise for oneself; without criticizing others; without attachment to anything; having risen above the perceptions of existence; without delighting in the three realms; while turning away from the pleasures of the sensory field of the world, perceiving the field of the tathāgatas, having the pure motivation of the bodhisattvas, having created the thunderbolt of the superior motivation, and dedicated with great love to all beings; through compassion for all beings undertaking the ending of suffering; with a sincere focus on the strengths of the tathāgatas; and while training in the path of the bodhisattvas, adorning the path that brings forth the displays of the Mahāyāna, and gazing upon the gateway into omniscience, in that way accomplishing actions that are difficult to do.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྒོམ་མངོན་པར་བལྟ་བར་བྱ་བའི་ཚུལ་གྱིས་དེ་དག་དེ་ལྟ་བུར་དགའ་བ་དག་ཀྱང་བྱས་པར་གྱུར་ཏོ། །རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཡུན་དེ་སྲིད་དུ་རིང་བ་ཞིག་ནས་ཐོབ་པར་གྱུར་ཏོ། །
en: “Noble one, that is how long it has been since I attained this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ལ་ལོག་པར་གསོལ་བ་འདེབས་ཤིང་ཁོ་མོ་བསད་པའི་ཕྱིར་གྲོས་སུ་གསོལ་བའི་བློན་པོ་ལྔ་བརྒྱ་པོ་རྣམས་གཞན་དག་གཅིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི། དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think that anyone else was at that time, in that time, the five hundred ministers who made a perverse request to King Jayaprabha and gave their counsel so that I would be executed, do not see them in that way.

source: ལྷས་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་དགྲོངས་པའི་ཕྱིར་སྐྱེས་བུ་ལྔ་བརྒྱ་བཀྱེ་བ་དེ་དག་ཡིན་ཏེ། དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་མ་འོངས་པའི་དུས་བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ན་བསྐལ་པ་འོད་བཟང་པོ་ཞེས་བྱ་བ་གཅིག་ལ་སངས་རྒྱས་ལྔ་བརྒྱ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་དང་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པ། རིགས་དང་རྒྱུད་སྣ་ཚོགས་སུ་སྐྱེས་པ། ཕ་དང་མ་སྣ་ཚོགས་སུ་སྨོས་པ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་བ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ་མངོན་པར་འབྱུང་བའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་ལྡན་པ། བྱང་ཆུབ་ཀྱི་ཤིང་གི་འོད་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ། སྙིང་པོ་བྱང་ཆུབ་སྣ་ཚོགས་སུ་ཉེ་བར་འདོད་བའི་སྒོ་སྣ་ཚོགས་དང་ལྡན་པ། བདུད་ཕམ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ་མངོན་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་ཚུལ་དང་། མྱིང་དང་ངེས་པའི་ཚིག་སྣ་ཚོགས་དང་ལྡན་པ། མདོ་སྡེའི་ཚུལ་ཤིན་ཏུ་བསྟན་པ་སྣ་ཚོགས་དང་ལྡན་པ།
en: They were the five hundred men sent by Devadatta to assassinate the Bhagavat.

source: ཚིག་གི་ལམ་དང་སྐད་སྣ་ཚོགས་རབ་ཏུ་སྟོན་པ། འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པ། འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་མཐུ་དང་རྒྱན་སྣ་ཚོགས་རབ་ཏུ་འགྱེད་པ། ཚེའི་ཚད་སྣ་ཚོགས་དང་ལྡན་པ། བསྟན་པའི་བྱིན་གྱི་རླབས་སྣ་ཚོགས་དང་ལྡན་པ། བསྟན་པ་རྣམ་པར་དམྱིགས་པ་སྣ་ཚོགས་དང་ལྡན་པ། མྱིང་སྣ་ཚོགས་དང་ལྡན་པ།
en: “The Bhagavat has prophesied that they too will attain the highest, complete enlightenment in a future time, after as many kalpas as there are atoms in Sumeru, in a kalpa called Suprabha, as five hundred buddhas with various qualities and displays of a buddha realm, born into various clans and castes; with mothers and fathers with various names; manifesting various miraculous births; with various miraculous settings forth into homelessness; manifesting various lights from Bodhi trees; having various gateways into going toward bodhimaṇḍas; manifesting various defeats of Māra; manifesting various miraculous attainments of buddhahood; having various ways of turning the Dharma wheel, of terms, and of definitions; teaching various ways of the sūtras; teaching with various kinds of speech and voice; having an array of various assemblies of followers; radiating the various displays and powers of their halos of light; having various lifespans; having various blessings from their teachings; their teachings having various objectives; having various names; and all having bodies of great compassion.

source: སྙིང་རྗེ་ཆེན་པོའི་ལུས་སུ་གྱུར་པ་ཤ་སྟག་ཏུ་འགྱུར་ཏེ། དེ་དག་གི་བསྐལ་པའི་དང་པོ་ལ་དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ཆེན་པོ་མངའ་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་འོད་དུ་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ། །
en: “The first in that kalpa will be a tathāgata by the name of Mahākāruṇika, who will attain the highest, complete enlightenment of buddhahood in a world realm called Ratnaprabhā.

source: དེའི་རྗེས་ལ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་གཉིས་པ་འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པའི་སྨོན་ལམ་ཟླ་བ་ཞེས་བྱ་བ་འབྱུང་ངོ་། །
en: After him, in that same world, there will be the second tathāgata called Sarva­jagad­dhita­praṇidhāna­candra.

source: དེ་བཞིན་གཤེགས་པ་གསུམ་པ་ཐུགས་རྗེ་ཆེན་པོའི་སེང་གེ་ཞེས་བྱ་བ་འབྱུང་ངོ་། །
en: The third tathāgata will be called Mahā­karuṇā­siṃha.

source: དེ་བཞིན་གཤེགས་པ་བཞི་པ་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པར་མཛད་པ་ཞེས་བྱ་བ་འབྱུང་བ་ནས།
en: The fourth tathāgata will be called Sarva­loka­hitaiṣin.

source: ཐམས་ཅད་ཀྱི་ཐ་མ་དེ་བཞིན་གཤེགས་པ་སྨན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། །
en: The last of them all will be a tathāgata called Vaidyarāja.

source: དེའི་ཚེ་དེའི་དུས་ན་གཡོན་དང་ལྡན་པའི་མིའི་རྒྱལ་པོ་ལ་སྙིང་རིང་བར་གྱུར་ཏེ། ཁོ་མོས་གསོད་མ་མྱིའི་ལག་ཏུ་ཕྱིན་པ་ལས་རང་གི་ལུས་དང་སྲོག་ཡོངས་སུ་བཏང་སྟེ། བཙོན་ར་དེ་དག་ནས་བཀྱེ་བ་དེ་རྣམས་གཞན་དག་ཅིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི། དེ་ལྟར་མྱི་བལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལོག་པར་དད་སེལ་ལ་སྩོགས་པ་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་།
en: “Noble one, as for the men who were criminals at that time, in that time, who had committed offenses against the king, and whom I freed from imprisonment by going to the executioners and giving up my life and body, if you think that they were anyone else, do not see them in that way.

source: དེ་མ་ཡིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མྱེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་དག་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྟོབས་མཐའ་ཡས་གྲགས་པར་བརྗོད་པའི་དཔལ་ཡང་དག་པར་འབྱུང་བའི་བློ་གྲོས་མཐོང་བར་གྱུར་མ་ཐག་ཏུ་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། ད་ལྟར་ཕྱོགས་བཅུ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཡང་སྒོམ་ཞིང་ཤིན་ཏུ་རྒྱས་པར་བྱེད་པ་དག་གོ །
en: They were the tathāgatas of the Bhadra kalpa, beginning with Krakucchanda, and also countless millions of bodhisattvas, who upon seeing the Bhagavat, the Tathāgata Ananta­bala­vighuṣṭa­nirnādita­śrī­saṃbhava­mati, developed the aspiration for the highest, complete enlightenment and are now practicing bodhisattva conduct in the ten directions and meditating and increasing this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ཅེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི། དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think that King Jayaprabha at that time, in that time, was anyone else, do not see him in that way.

source: སྨྲ་བ་ཆེན་པོ་བདེན་པ་ཅན་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: The great teacher Satyaka was at that time, in that time, King Jayaprabha.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་འཁོར་དུ་གྱུར་པ་བཙུན་མོའི་འཁོར་དང་། བཙུན་མོའི་གནས་ཀྱི་སྒོ་བའམ། འཁོར་ན་གནས་པའམ། རྗེས་སུ་འཆའ་བ་དེ་དག་ཀྱང་གཞན་དག་ཅིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think that King Jayaprabha’s retinue of queens in the harem, the sentinels at the harem entrance, and his court and attendants at that time, in that time, were anyone else, do not see them in that way.

source: ཞགས་པ་འཐུབ་པ་སྟོང་ཕྲག་དྲུག་ཅུ་པོ་སྨྲ་བ་ཆེན་པོ་བདེན་པ་ཅན་གྱིས་སྨྲ་བའི་རྒྱལ་མཚན་ཡོངས་སུ་གཟུང་བའི་དོན་དུ་བཅོམ་ལྡན་འདས་ལ་རྒོལ་དུ་འགྲོ་བའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བླགས་ནས་ཀུན་ཀྱང་ཞིང་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་། བསྐལ་བ་སྣ་ཚོགས་དང་། མྱིང་སྣ་ཚོགས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དག་གོ །
en: They were these six thousand Jains whom Satyaka brought before the Bhagavat, who came to debate against the Bhagavat so as to possess the victory banner of teaching, and when they came, the Bhagavat prophesied their attainment of the highest, complete enlightenment, telling them that they would come into a world as tathāgatas with the arrays of various realms, in various kalpas, and with various names.
